Core/src/Documents/ПлатежнаяВедомость/ПлатежнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатежнаяВедомость</name>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПлатежнаяВедомость</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДФЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторВИнтернетБанке</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПФПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияНДФЛ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияПФ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЛгот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/AccumulationRegisters/РасчетыСПерсоналом/РасчетыСПерсоналом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПерсоналом</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчастникПенсионногоФонда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетДобровольно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/AccumulationRegisters/РасчетыПоУдержаниям/РасчетыПоУдержаниям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыПоУдержаниям</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДФЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУдержания</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/НалоговыеЛготы/НалоговыеЛготы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НалоговыеЛготы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЛгот</name>
    <type>
      <types>EnumRef.ТипЛгот</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/РасчетыСПенсионнымФондом/РасчетыСПенсионнымФондом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПенсионнымФондом</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНачисленияУдержания</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СотрудникКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииПФ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/РасчетыНДФЛ/РасчетыНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыНДФЛ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНачисленияУдержания</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииПФ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ВидыОперацийПлатежнаяВедомость/ВидыОперацийПлатежнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПлатежнаяВедомость</name>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеДляКонтрагента</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ОперацииПФ/ОперацииПФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииПФ</name>
  <enumValues>
    <name>Начисленный</name>
  </enumValues>
  <enumValues>
    <name>КОплате</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ПлатежнаяВедомость/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Сотрудники.Итог("СуммаПлатежа");
	//Паганини ПФ_
	СуммаНДФЛ	= Сотрудники.Итог("НДФЛПлатежа");
	СуммаПФ		= Сотрудники.Итог("СуммаПФПлатежа");
	//_Паганини ПФ	
	//Паганини#Удержания_
	Если НЕ ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента Тогда
		Для Каждого СтрокаС ИЗ Сотрудники Цикл
			СтрокаС.ВидУдержания 		= Неопределено;
		КонецЦикла;
	КонецЕсли;
	//_Паганини#Удержания
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Процедура заполняет табличную часть Сотрудники остатками по начислениям.
//
Процедура ЗаполнитьПоОстаткамНаСервере() Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Зарплата Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РасчетыСПерсоналомОстатки.Сотрудник,
		               |	СУММА(ВЫБОР
		               |			КОГДА &ВалютаРасчетов = &ВалютаДокумента
		               |				ТОГДА РасчетыСПерсоналомОстатки.СуммаВалОстаток
		               |			ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПерсоналомОстатки.СуммаВалОстаток * &Курс / &Кратность КАК ЧИСЛО(15, 2))
		               |		КОНЕЦ) КАК СуммаПлатежа,
		               |	СУММА(РасчетыСПерсоналомОстатки.СуммаВалОстаток) КАК СуммаРасчетов
		               |ИЗ
		               |	РегистрНакопления.РасчетыСПерсоналом.Остатки(,
		               |			Организация = &Организация
		               |				И ПериодРегистрации = &ПериодРегистрации
		               |				И Валюта = &ВалютаРасчетов
		               |				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК РасчетыСПерсоналомОстатки
		               |ГДЕ
		               |	РасчетыСПерсоналомОстатки.СуммаВалОстаток > 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РасчетыСПерсоналомОстатки.Сотрудник
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	РасчетыСПерсоналомОстатки.Сотрудник.Наименование";
		
		Запрос.УстановитьПараметр("ПериодРегистрации", 	ПериодРегистрации);
		Запрос.УстановитьПараметр("Организация", 		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ВалютаРасчетов",		ВалютаРасчетов);
		Запрос.УстановитьПараметр("ВалютаДокумента",	ВалютаДокумента);
		Запрос.УстановитьПараметр("Курс",				Курс);
		Запрос.УстановитьПараметр("Кратность",			Кратность);
		
		Сотрудники.Загрузить(Запрос.Выполнить().Выгрузить());

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Аванс Тогда	
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='ავანსის გადახდისას ნაშთების მიხედვით შევსება გათვალისწინებული არ არის!';ru='При выплате аванса заполнение по остаткам не предусмотрено!';en='Upon payment of the advance is not the filling of balances provided!'");
 		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет табличную часть Сотрудники по подразделению.
//
Процедура ЗаполнитьПоПодразделениюНаСервере() Экспорт
	
	// Сотрудники:
	// 1. Уволенные, переведенные из 
	//  - на начало периода есть запись о принадлежности к указанному подразделению;
	// 2. Работающие.
	//  - на начало периода есть запись о принадлежности к указанному подразделению;
	// 3. Принятые на работу, переведенные в
	//  - в течении периода будет запись с указанным подразделением;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(СотрудникиСрезПоследних.Период) КАК Период,
	|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
	|	СотрудникиСрезПоследних.ВидУдержанияНДФЛ,
	|	СотрудникиСрезПоследних.ВидУдержанияПФ
	|ПОМЕСТИТЬ СотрудникиЧислящиесяНаНачалоПериода
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(&ПериодРегистрации, Организация = &Организация) КАК СотрудникиСрезПоследних
	|ГДЕ
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|СГРУППИРОВАТЬ ПО
	|	СотрудникиСрезПоследних.Сотрудник,
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница,
	|	СотрудникиСрезПоследних.ВидУдержанияПФ,
	|	СотрудникиСрезПоследних.ВидУдержанияНДФЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Период КАК Период,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ВидУдержанияНДФЛ,
	|	Сотрудники.ВидУдержанияПФ
	|ПОМЕСТИТЬ СотрудникиПереведенныеПринятыеВПериоде
	|ИЗ
	|	РегистрСведений.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Организация = &Организация
	|	И Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Сотрудники.Период МЕЖДУ &ПериодРегистрации И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиЧислящиесяНаНачалоПериода.Сотрудник,
	|	СотрудникиЧислящиесяНаНачалоПериода.ВидУдержанияНДФЛ,
	|	СотрудникиЧислящиесяНаНачалоПериода.ВидУдержанияПФ
	|ИЗ
	|	СотрудникиЧислящиесяНаНачалоПериода КАК СотрудникиЧислящиесяНаНачалоПериода
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СотрудникиПереведенныеПринятыеВПериоде.Сотрудник,
	|	СотрудникиПереведенныеПринятыеВПериоде.ВидУдержанияНДФЛ,
	|	СотрудникиПереведенныеПринятыеВПериоде.ВидУдержанияПФ
	|ИЗ
	|	СотрудникиПереведенныеПринятыеВПериоде КАК СотрудникиПереведенныеПринятыеВПериоде";

	Запрос.УстановитьПараметр("ПериодРегистрации",	ПериодРегистрации);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",	СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Организация",		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	
	Сотрудники.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


//---РОССОФТ ----

// Процедура заполняет табличную часть Сотрудники остатками по начислениям.
//
Процедура ЗаполнитьПоОстаткамНаСервере_Новый() Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Зарплата Тогда
	
		Запрос = Новый Запрос;
		//Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РасчетыПоУдержаниямОбороты.Организация,
		               |	РасчетыПоУдержаниямОбороты.Сотрудник,
		               |	СУММА(РасчетыПоУдержаниямОбороты.СуммаПФОстаток) КАК СуммаПФОборот,
		               |	СУММА(РасчетыПоУдержаниямОбороты.СуммаНДФЛОстаток) КАК СуммаНДФЛОборот
		               |ПОМЕСТИТЬ РасчетыПоУдержаниямОстатки
		               |ИЗ
		               |	РегистрНакопления.РасчетыПоУдержаниям.Остатки(, Организация = &Организация И ПериодРегистрации = &ПериодРегистрации) КАК РасчетыПоУдержаниямОбороты
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РасчетыПоУдержаниямОбороты.Организация,
		               |	РасчетыПоУдержаниямОбороты.Сотрудник
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	НалоговыеЛготыОстатки.Сотрудник,
		               |	НалоговыеЛготыОстатки.СуммаОстаток,
		               |	НалоговыеЛготыОстатки.Организация,
		               |	НалоговыеЛготыОстатки.Подразделение
		               |ПОМЕСТИТЬ ВтНалоговыеЛготы
		               |ИЗ
		               |	РегистрНакопления.НалоговыеЛготы.Остатки(
		               |			&ДатаЛгот,
		               |			Организация = &Организация
		               |				И Подразделение = &СтруктурнаяЕдиница
		               |				И ТипЛгот = &ТипЛгот) КАК НалоговыеЛготыОстатки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(РасчетыСПенсионнымФондомОстатки.Плательщик КАК Справочник.Сотрудники) КАК Сотрудник,
		               |	РасчетыСПенсионнымФондомОстатки.ВидНачисленияУдержания КАК ВидУдержанияПФ,
		               |	РасчетыСПенсионнымФондомОстатки.СуммаВалОстаток КАК СуммаПФВалОстаток
		               |ПОМЕСТИТЬ РасчетыПФ
		               |ИЗ
		               |	РегистрНакопления.РасчетыСПенсионнымФондом.Остатки(
		               |			,
		               |			Организация = &Организация
		               |				И ПериодРегистрации = &ПериодРегистрации
		               |				И Плательщик ССЫЛКА Справочник.Сотрудники
		               |				И Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный)) КАК РасчетыСПенсионнымФондомОстатки
		               |ГДЕ
		               |	РасчетыСПенсионнымФондомОстатки.СуммаВалОстаток > 0
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РасчетыНДФЛОстатки.Сотрудник,
		               |	РасчетыНДФЛОстатки.ВидНачисленияУдержания КАК ВидУдержанияНДФЛ,
		               |	РасчетыНДФЛОстатки.СуммаВалОстаток
		               |ПОМЕСТИТЬ РасчетыНДФЛ
		               |ИЗ
		               |	РегистрНакопления.РасчетыНДФЛ.Остатки(
		               |			,
		               |			Организация = &Организация
		               |				И ПериодРегистрации = &ПериодРегистрации
		               |				И Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный)) КАК РасчетыНДФЛОстатки
		               |ГДЕ
		               |	РасчетыНДФЛОстатки.СуммаВалОстаток > 0
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РасчетыСПерсоналомОстатки.Сотрудник,
		               |	СУММА(ВЫБОР
		               |			КОГДА &ВалютаРасчетов = &ВалютаДокумента
		               |				ТОГДА РасчетыСПерсоналомОстатки.СуммаВалОстаток
		               |			ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПерсоналомОстатки.СуммаВалОстаток * &Курс * КурсыВалютыДокумента.Кратность / КурсыВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
		               |		КОНЕЦ) КАК СуммаПлатежа,
		               |	СУММА(РасчетыСПерсоналомОстатки.СуммаВалОстаток) КАК СуммаРасчетов,
		               |	РасчетыНДФЛ.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
		               |	СУММА(ВЫБОР
		               |			КОГДА &ВалютаРасчетов = &ВалютаДокумента И НЕ СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении.Значение
		               |				ТОГДА РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
					   |			КОГДА &ВалютаРасчетов = &ВалютаДокумента И СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении.Значение
		               |				ТОГДА РасчетыНДФЛ.СуммаВалОстаток
					   |			КОГДА &ВалютаРасчетов <> &ВалютаДокумента И НЕ СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении.Значение
		               |				ТОГДА РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
					   |			КОГДА &ВалютаРасчетов <> &ВалютаДокумента И СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении.Значение
		               |				ТОГДА РасчетыНДФЛ.СуммаВалОстаток 
		               |			ИНАЧЕ РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		               |		КОНЕЦ) КАК НДФЛПлатежа,
		               |	РасчетыПФ.ВидУдержанияПФ КАК ВидУдержанияПФ,
		               |	ВЫБОР
		               |		КОГДА &ВалютаРасчетов = &ВалютаДокумента
		               |			ТОГДА РасчетыПФ.СуммаПФВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаПФОборот, 0)
		               |		ИНАЧЕ ВЫРАЗИТЬ((РасчетыПФ.СуммаПФВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаПФОборот, 0)) * &Курс * КурсыВалютыДокумента.Кратность / КурсыВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
		               |	КОНЕЦ КАК СуммаПФПлатежа,
		               |	ВЫБОР
		               |		КОГДА СУММА(ВтНалоговыеЛготы.СуммаОстаток) ЕСТЬ NULL
		               |				ИЛИ СУММА(ВтНалоговыеЛготы.СуммаОстаток) < СУММА(ВЫБОР
		               |						КОГДА &ВалютаРасчетов = &ВалютаДокумента
		               |							ТОГДА РасчетыСПерсоналомОстатки.СуммаВалОстаток
		               |						ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПерсоналомОстатки.СуммаВалОстаток * &Курс * КурсыВалютыДокумента.Кратность / КурсыВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
		               |					КОНЕЦ) + СУММА(ВЫБОР
		               |						КОГДА &ВалютаРасчетов = &ВалютаДокумента
		               |							ТОГДА РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		               |						ИНАЧЕ РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		               |					КОНЕЦ)
		               |			ТОГДА СУММА(ВтНалоговыеЛготы.СуммаОстаток)
		               |		ИНАЧЕ СУММА(ВЫБОР
		               |					КОГДА &ВалютаРасчетов = &ВалютаДокумента
		               |						ТОГДА РасчетыСПерсоналомОстатки.СуммаВалОстаток
		               |					ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПерсоналомОстатки.СуммаВалОстаток * &Курс * КурсыВалютыДокумента.Кратность / КурсыВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
		               |				КОНЕЦ) + СУММА(ВЫБОР
		               |					КОГДА &ВалютаРасчетов = &ВалютаДокумента
		               |						ТОГДА РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		               |					ИНАЧЕ РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		               |				КОНЕЦ)
		               |	КОНЕЦ КАК СуммаЛгот
		               |ИЗ
		               |	РегистрНакопления.РасчетыСПерсоналом.Остатки(
		               |			,
		               |			Организация = &Организация
		               |				И ПериодРегистрации = &ПериодРегистрации
		               |				И Валюта = &ВалютаРасчетов
		               |				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК РасчетыСПерсоналомОстатки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РасчетыПФ КАК РасчетыПФ
		               |		ПО РасчетыСПерсоналомОстатки.Сотрудник = РасчетыПФ.Сотрудник
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РасчетыНДФЛ КАК РасчетыНДФЛ
		               |		ПО РасчетыСПерсоналомОстатки.Сотрудник = РасчетыНДФЛ.Сотрудник
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &ВалютаДокумента) КАК КурсыВалютыДокумента
		               |		ПО (ИСТИНА)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВтНалоговыеЛготы КАК ВтНалоговыеЛготы
		               |		ПО РасчетыСПерсоналомОстатки.Сотрудник = ВтНалоговыеЛготы.Сотрудник
		               |			И РасчетыСПерсоналомОстатки.Организация = ВтНалоговыеЛготы.Организация
		               |			И РасчетыСПерсоналомОстатки.СтруктурнаяЕдиница = ВтНалоговыеЛготы.Подразделение
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РасчетыПоУдержаниямОстатки КАК РасчетыПоУдержаниямОстатки
		               |		ПО РасчетыСПерсоналомОстатки.Организация = РасчетыПоУдержаниямОстатки.Организация
		               |			И РасчетыСПерсоналомОстатки.Сотрудник = РасчетыПоУдержаниямОстатки.Сотрудник
					   //+++ Дмгг
					   |,
					   |		Константа.СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении КАК СуммыНалоговУдержаниеДляКонтрагентаКОплатеПриНачислении
					   //--- Дмгг
					   |ГДЕ
		               |	РасчетыСПерсоналомОстатки.СуммаВалОстаток > 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РасчетыСПерсоналомОстатки.Сотрудник,
		               |	РасчетыПФ.ВидУдержанияПФ,
		               |	РасчетыНДФЛ.ВидУдержанияНДФЛ,
		               |	ВЫБОР
		               |		КОГДА &ВалютаРасчетов = &ВалютаДокумента
		               |			ТОГДА РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0)
		               |		ИНАЧЕ ВЫРАЗИТЬ(РасчетыНДФЛ.СуммаВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаНДФЛОборот, 0) * &Курс * КурсыВалютыДокумента.Кратность / КурсыВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА &ВалютаРасчетов = &ВалютаДокумента
		               |			ТОГДА РасчетыПФ.СуммаПФВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаПФОборот, 0)
		               |		ИНАЧЕ ВЫРАЗИТЬ((РасчетыПФ.СуммаПФВалОстаток - ЕСТЬNULL(РасчетыПоУдержаниямОстатки.СуммаПФОборот, 0)) * &Курс * КурсыВалютыДокумента.Кратность / КурсыВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
		               |	КОНЕЦ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	РасчетыСПерсоналомОстатки.Сотрудник.Наименование";
		
		Запрос.УстановитьПараметр("ПериодРегистрации", 	ПериодРегистрации);
		Запрос.УстановитьПараметр("ДатаЛгот", 	        ПериодРегистрации + 1);
		Запрос.УстановитьПараметр("Организация", 		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ВалютаРасчетов",		ВалютаРасчетов);
		Запрос.УстановитьПараметр("ВалютаДокумента",	ВалютаДокумента);
		Запрос.УстановитьПараметр("Курс",				Курс);
		Запрос.УстановитьПараметр("Кратность",			Кратность);
		Запрос.УстановитьПараметр("КонецМесяца", 		КонецМесяца(ПериодРегистрации));
		Запрос.УстановитьПараметр("Дата", 				Дата);
		Запрос.УстановитьПараметр("ТипЛгот", 			Перечисления.ТипЛгот.Прочее);
		
		Сотрудники.Загрузить(Запрос.Выполнить().Выгрузить());

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Аванс Тогда	
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='ავანსის გადახდისას ნაშთების მიხედვით შევსება გათვალისწინებული არ არის!';ru='При выплате аванса заполнение по остаткам не предусмотрено!';en='Upon payment of the advance is not the filling of balances provided!'");
 		Сообщение.Сообщить();
	//Паганини#Удержания_
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НалоговыеЛготыОстатки.Сотрудник,
			|	НалоговыеЛготыОстатки.СуммаОстаток,
			|	НалоговыеЛготыОстатки.Организация,
			|	НалоговыеЛготыОстатки.Подразделение
			|ПОМЕСТИТЬ ВтНалоговыеЛготы
			|ИЗ
			|	РегистрНакопления.НалоговыеЛготы.Остатки(
			|			&ДатаЛгот,
			|			Организация = &Организация
			|				И Подразделение = &СтруктурнаяЕдиница
			|				И ТипЛгот = &ТипЛгот) КАК НалоговыеЛготыОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасчетыПоУдержаниямОбороты.Организация,
			|	РасчетыПоУдержаниямОбороты.Сотрудник,
			|	РасчетыПоУдержаниямОбороты.ВидУдержания,
			|	РасчетыПоУдержаниямОбороты.ВидУдержанияНДФЛ,
			|	РасчетыПоУдержаниямОбороты.ВидУдержанияПФ,
			|	СУММА(ВЫБОР
			|			КОГДА &ВалютаУчета = &ВалютаДокумента
			|				ТОГДА РасчетыПоУдержаниямОбороты.СуммаОборот
			|			ИНАЧЕ ВЫРАЗИТЬ(РасчетыПоУдержаниямОбороты.СуммаОборот * КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность / КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность КАК ЧИСЛО(15, 2))
			|		КОНЕЦ) КАК СуммаРасчетов,
			|	СУММА(ВЫБОР
			|			КОГДА &ВалютаРасчетов = &ВалютаДокумента
			|				ТОГДА РасчетыПоУдержаниямОбороты.СуммаОборот
			|			ИНАЧЕ ВЫРАЗИТЬ(РасчетыПоУдержаниямОбороты.СуммаОборот * &Курс * КурсВалютыДокумента.Кратность / КурсВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
			|		КОНЕЦ) КАК СуммаПлатежа,
			|	СУММА(ВЫБОР
			|			КОГДА &ВалютаРасчетов = &ВалютаДокумента
			|				ТОГДА РасчетыПоУдержаниямОбороты.СуммаНДФЛОборот
			|			ИНАЧЕ ВЫРАЗИТЬ(РасчетыПоУдержаниямОбороты.СуммаНДФЛОборот * &Курс * КурсВалютыДокумента.Кратность / КурсВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
			|		КОНЕЦ) КАК НДФЛПлатежа,
			|	СУММА(ВЫБОР
			|			КОГДА &ВалютаРасчетов = &ВалютаДокумента
			|				ТОГДА РасчетыПоУдержаниямОбороты.СуммаПФОборот
			|			ИНАЧЕ ВЫРАЗИТЬ(РасчетыПоУдержаниямОбороты.СуммаПФОборот * &Курс * КурсВалютыДокумента.Кратность / КурсВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
			|		КОНЕЦ) КАК СуммаПФПлатежа,
			|	ВЫБОР
			|		КОГДА СУММА(ВтНалоговыеЛготы.СуммаОстаток) ЕСТЬ NULL
			|				ИЛИ СУММА(ВтНалоговыеЛготы.СуммаОстаток) < СУММА(ВЫБОР
			|						КОГДА &ВалютаУчета = &ВалютаДокумента
			|							ТОГДА РасчетыПоУдержаниямОбороты.СуммаОборот
			|						ИНАЧЕ ВЫРАЗИТЬ(РасчетыПоУдержаниямОбороты.СуммаОборот * КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность / КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность КАК ЧИСЛО(15, 2))
			|					КОНЕЦ) + СУММА(ВЫБОР
			|						КОГДА &ВалютаРасчетов = &ВалютаДокумента
			|							ТОГДА РасчетыПоУдержаниямОбороты.СуммаНДФЛОборот
			|						ИНАЧЕ ВЫРАЗИТЬ(РасчетыПоУдержаниямОбороты.СуммаНДФЛОборот * &Курс * КурсВалютыДокумента.Кратность / КурсВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
			|					КОНЕЦ)
			|			ТОГДА СУММА(ВтНалоговыеЛготы.СуммаОстаток)
			|		ИНАЧЕ СУММА(ВЫБОР
			|					КОГДА &ВалютаУчета = &ВалютаДокумента
			|						ТОГДА РасчетыПоУдержаниямОбороты.СуммаОборот
			|					ИНАЧЕ ВЫРАЗИТЬ(РасчетыПоУдержаниямОбороты.СуммаОборот * КурсВалютыУчета.Курс * КурсВалютыДокумента.Кратность / КурсВалютыДокумента.Курс * КурсВалютыУчета.Кратность КАК ЧИСЛО(15, 2))
			|				КОНЕЦ) + СУММА(ВЫБОР
			|					КОГДА &ВалютаРасчетов = &ВалютаДокумента
			|						ТОГДА РасчетыПоУдержаниямОбороты.СуммаНДФЛОборот
			|					ИНАЧЕ ВЫРАЗИТЬ(РасчетыПоУдержаниямОбороты.СуммаНДФЛОборот * &Курс * КурсВалютыДокумента.Кратность / КурсВалютыДокумента.Курс * &Кратность КАК ЧИСЛО(15, 2))
			|				КОНЕЦ)
			|	КОНЕЦ КАК СуммаЛгот
			|ИЗ
			|	РегистрНакопления.РасчетыПоУдержаниям.Обороты(, , Авто, ПериодРегистрации = &ПериодРегистрации) КАК РасчетыПоУдержаниямОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &ВалютаДокумента) КАК КурсВалютыДокумента
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &ВалютаУчета) КАК КурсВалютыУчета
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(&Дата, ) КАК СотрудникиСрезПоследних
			|		ПО РасчетыПоУдержаниямОбороты.Организация = СотрудникиСрезПоследних.Организация
			|			И РасчетыПоУдержаниямОбороты.Сотрудник = СотрудникиСрезПоследних.Сотрудник
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтНалоговыеЛготы КАК ВтНалоговыеЛготы
			|		ПО (СотрудникиСрезПоследних.Сотрудник = ВтНалоговыеЛготы.Сотрудник)
			|			И (СотрудникиСрезПоследних.Организация = ВтНалоговыеЛготы.Организация)
			|			И (СотрудникиСрезПоследних.СтруктурнаяЕдиница = ВтНалоговыеЛготы.Подразделение)
			|ГДЕ
			|	СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетыПоУдержаниямОбороты.Организация,
			|	РасчетыПоУдержаниямОбороты.Сотрудник,
			|	РасчетыПоУдержаниямОбороты.ВидУдержания,
			|	РасчетыПоУдержаниямОбороты.ВидУдержанияПФ,
			|	РасчетыПоУдержаниямОбороты.ВидУдержанияНДФЛ";
		Запрос.УстановитьПараметр("ВалютаРасчетов",		ВалютаРасчетов);
		Запрос.УстановитьПараметр("ВалютаДокумента",	ВалютаДокумента);
		Запрос.УстановитьПараметр("ВалютаУчета",		УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета());
		Запрос.УстановитьПараметр("Курс",				Курс);
		Запрос.УстановитьПараметр("Организация", 		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
		Запрос.УстановитьПараметр("Кратность",			Кратность);
		Запрос.УстановитьПараметр("Дата", 				Дата);
		Запрос.УстановитьПараметр("ПериодРегистрации", 	ПериодРегистрации);
		Запрос.УстановитьПараметр("ДатаЛгот", 	        ПериодРегистрации + 1);
		Запрос.УстановитьПараметр("ТипЛгот", 			Перечисления.ТипЛгот.УдержаниеДляКонтрагента);
		Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
			Запрос.УстановитьПараметр("СтруктурнаяЕдиница",	СтруктурнаяЕдиница);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "Истина");
		КонецЕсли;
		Сотрудники.Загрузить(Запрос.Выполнить().Выгрузить());
	//_Паганини#Удержания
		
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти

#КонецЕсли

//Паганини#Удержания_
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.УдержаниеДляКонтрагента Тогда
		ПроверяемыеРеквизиты.Добавить("Сотрудники.ВидУдержания");
	Иначе
		ПроверяемыеРеквизиты.Добавить("СтруктурнаяЕдиница");
	КонецЕсли;
КонецПроцедуры

Процедура СообщитьОбОшибке(НомерСтроки, ИмяПоля, СинонимПоля, Отказ)
	ТекстСообщения = "სტრიქონში " + НомерСтроки + " არ არის შევსებული სვეტი " + СинонимПоля;
	УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект,	ТекстСообщения, "Сотрудники", НомерСтроки, ИмяПоля, Отказ);
КонецПроцедуры
//_Паганини#Удержания
